{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/iosManagedAppProtections/$entity",
    "displayName": "Level 1: All Apps",
    "description": "Protects data using in Microsoft Apps",
    "roleScopeTagIds": [
        "0"
    ],
    "version": "\"81016b6c-0000-0d00-0000-6425daf30000\"",
    "periodOfflineBeforeAccessCheck": "PT12H",
    "periodOnlineBeforeAccessCheck": "PT30M",
    "allowedInboundDataTransferSources": "allApps",
    "allowedOutboundDataTransferDestinations": "allApps",
    "organizationalCredentialsRequired": true,
    "allowedOutboundClipboardSharingLevel": "managedAppsWithPasteIn",
    "dataBackupBlocked": true,
    "deviceComplianceRequired": true,
    "managedBrowserToOpenLinksRequired": false,
    "saveAsBlocked": false,
    "periodOfflineBeforeWipeIsEnforced": "P90D",
    "pinRequired": true,
    "maximumPinRetries": 5,
    "simplePinBlocked": true,
    "minimumPinLength": 4,
    "pinCharacterSet": "numeric",
    "periodBeforePinReset": "PT0S",
    "allowedDataStorageLocations": [],
    "contactSyncBlocked": false,
    "printBlocked": true,
    "fingerprintBlocked": false,
    "disableAppPinIfDevicePinIsSet": false,
    "maximumRequiredOsVersion": null,
    "maximumWarningOsVersion": null,
    "maximumWipeOsVersion": null,
    "minimumRequiredOsVersion": "16.0",
    "minimumWarningOsVersion": null,
    "minimumRequiredAppVersion": null,
    "minimumWarningAppVersion": null,
    "minimumWipeOsVersion": null,
    "minimumWipeAppVersion": null,
    "appActionIfDeviceComplianceRequired": "block",
    "appActionIfMaximumPinRetriesExceeded": "block",
    "pinRequiredInsteadOfBiometricTimeout": "PT30M",
    "allowedOutboundClipboardSharingExceptionLength": 0,
    "notificationRestriction": "allow",
    "previousPinBlockCount": 0,
    "managedBrowser": "notConfigured",
    "maximumAllowedDeviceThreatLevel": "notConfigured",
    "mobileThreatDefenseRemediationAction": "block",
    "mobileThreatDefensePartnerPriority": null,
    "blockDataIngestionIntoOrganizationDocuments": false,
    "allowedDataIngestionLocations": [
        "oneDriveForBusiness",
        "sharePoint",
        "camera",
        "photoLibrary"
    ],
    "appActionIfUnableToAuthenticateUser": "block",
    "dialerRestrictionLevel": "allApps",
    "gracePeriodToBlockAppsDuringOffClockHours": null,
    "targetedAppManagementLevels": "unspecified",
    "appGroupType": "AllApps",
    "appDataEncryptionType": "whenDeviceLocked",
    "minimumRequiredSdkVersion": null,
    "deployedAppCount": 0,
    "faceIdBlocked": false,
    "minimumWipeSdkVersion": null,
    "allowedIosDeviceModels": null,
    "appActionIfIosDeviceModelNotAllowed": "block",
    "thirdPartyKeyboardsBlocked": false,
    "filterOpenInToOnlyManagedApps": false,
    "disableProtectionOfManagedOutboundOpenInData": false,
    "protectInboundDataFromUnknownSources": false,
    "customBrowserProtocol": "",
    "customDialerAppProtocol": "",
    "managedUniversalLinks": [
        "http://*.appsplatform.us/*",
        "http://*.onedrive.com/*",
        "http://*.powerapps.cn/*",
        "http://*.powerapps.com/*",
        "http://*.powerapps.us/*",
        "http://*.powerbi.com/*",
        "http://*.service-now.com/*",
        "http://*.sharepoint-df.com/*",
        "http://*.sharepoint.com/*",
        "http://*.yammer.com/*",
        "http://*.zoom.us/*",
        "http://*collab.apps.mil/l/*",
        "http://*devspaces.skype.com/l/*",
        "http://*teams-fl.microsoft.com/l/*",
        "http://*teams.live.com/l/*",
        "http://*teams.microsoft.com/l/*",
        "http://*teams.microsoft.us/l/*",
        "http://app.powerbi.cn/*",
        "http://app.powerbi.de/*",
        "http://app.powerbigov.us/*",
        "http://msit.microsoftstream.com/video/*",
        "http://tasks.office.com/*",
        "http://to-do.microsoft.com/sharing*",
        "http://web.microsoftstream.com/video/*",
        "http://zoom.us/*",
        "https://*.appsplatform.us/*",
        "https://*.onedrive.com/*",
        "https://*.powerapps.cn/*",
        "https://*.powerapps.com/*",
        "https://*.powerapps.us/*",
        "https://*.powerbi.com/*",
        "https://*.service-now.com/*",
        "https://*.sharepoint-df.com/*",
        "https://*.sharepoint.com/*",
        "https://*.yammer.com/*",
        "https://*.zoom.us/*",
        "https://*collab.apps.mil/l/*",
        "https://*devspaces.skype.com/l/*",
        "https://*teams-fl.microsoft.com/l/*",
        "https://*teams.live.com/l/*",
        "https://*teams.microsoft.com/l/*",
        "https://*teams.microsoft.us/l/*",
        "https://app.powerbi.cn/*",
        "https://app.powerbi.de/*",
        "https://app.powerbigov.us/*",
        "https://msit.microsoftstream.com/video/*",
        "https://tasks.office.com/*",
        "https://to-do.microsoft.com/sharing*",
        "https://web.microsoftstream.com/video/*",
        "https://zoom.us/*"
    ],
    "exemptedUniversalLinks": [
        "http://facetime.apple.com",
        "http://maps.apple.com",
        "https://facetime.apple.com",
        "https://maps.apple.com"
    ],
    "minimumWarningSdkVersion": null,
    "exemptedAppProtocols": [
        {
            "name": "Default",
            "value": "skype;app-settings;calshow;itms;itmss;itms-apps;itms-appss;itms-services;"
        }
    ]
}