{
    "allowedDataStorageLocations": [],
    "allowedInboundDataTransferSources": "allApps",
    "allowedOutboundClipboardSharingLevel": "managedAppsWithPasteIn",
    "allowedOutboundClipboardSharingExceptionLength": 0,
    "allowedOutboundDataTransferDestinations": "allApps",
    "contactSyncBlocked": false,
    "dataBackupBlocked": true,
    "description": "",
    "deviceComplianceRequired": true,
    "displayName": "Level 1 Android Microsoft App Protection",
    "managedBrowserToOpenLinksRequired": false,
    "managedBrowser": "notConfigured",
    "customBrowserProtocol": "",
    "customBrowserPackageId": "",
    "customBrowserDisplayName": "",
    "maximumPinRetries": 5,
    "minimumPinLength": 4,
    "previousPinBlockCount": 0,
    "notificationRestriction": "allow",
    "organizationalCredentialsRequired": true,
    "gracePeriodToBlockAppsDuringOffClockHours": null,
    "periodOfflineBeforeAccessCheck": "PT720M",
    "periodOfflineBeforeWipeIsEnforced": "P90D",
    "periodOnlineBeforeAccessCheck": "PT30M",
    "pinRequiredInsteadOfBiometric": true,
    "pinRequiredInsteadOfBiometricTimeout": "PT30M",
    "periodBeforePinResetRequired": false,
    "periodBeforePinReset": "P0D",
    "pinCharacterSet": "numeric",
    "pinRequired": true,
    "printBlocked": true,
    "saveAsBlocked": false,
    "simplePinBlocked": true,
    "fingerprintBlocked": false,
    "disableAppPinIfDevicePinIsSet": false,
    "minimumWipeOsVersion": null,
    "minimumRequiredOsVersion": null,
    "minimumWarningOsVersion": "13.0",
    "minimumWipeAppVersion": null,
    "minimumRequiredAppVersion": null,
    "minimumWarningAppVersion": null,
    "minimumRequiredCompanyPortalVersion": null,
    "minimumWarningCompanyPortalVersion": null,
    "minimumWipeCompanyPortalVersion": null,
    "exemptedAppPackages": [],
    "exemptedAppProtocols": [
        {
            "name": "Default",
            "value": "skype;app-settings;calshow;itms;itmss;itms-apps;itms-appss;itms-services;"
        }
    ],
    "targetedAppManagementLevels": "unspecified",
    "appActionIfDeviceComplianceRequired": "block",
    "appActionIfMaximumPinRetriesExceeded": "block",
    "roleScopeTagIds": [],
    "blockDataIngestionIntoOrganizationDocuments": false,
    "allowedDataIngestionLocations": [
        "oneDriveForBusiness",
        "sharePoint",
        "camera",
        "photoLibrary"
    ],
    "appActionIfUnableToAuthenticateUser": "block",
    "dialerRestrictionLevel": "allApps",
    "customDialerAppProtocol": "",
    "customDialerAppPackageId": "",
    "customDialerAppDisplayName": "",
    "blockAfterCompanyPortalUpdateDeferralInDays": 0,
    "warnAfterCompanyPortalUpdateDeferralInDays": 0,
    "wipeAfterCompanyPortalUpdateDeferralInDays": 0,
    "maximumWipeOsVersion": null,
    "maximumRequiredOsVersion": null,
    "maximumWarningOsVersion": null,
    "appActionIfAccountIsClockedOut": null,
    "@odata.type": "#microsoft.graph.androidManagedAppProtection",
    "shareWithBrowserVirtualSetting": "anyApp",
    "appGroupType": "allMicrosoftApps",
    "screenCaptureBlocked": false,
    "encryptAppData": true,
    "disableAppEncryptionIfDeviceEncryptionIsEnabled": false,
    "minimumRequiredPatchVersion": null,
    "minimumWarningPatchVersion": null,
    "minimumWipePatchVersion": null,
    "allowedAndroidDeviceManufacturers": "",
    "appActionIfAndroidDeviceManufacturerNotAllowed": "block",
    "requiredAndroidSafetyNetDeviceAttestationType": "none",
    "appActionIfAndroidSafetyNetDeviceAttestationFailed": "block",
    "requiredAndroidSafetyNetAppsVerificationType": "none",
    "appActionIfAndroidSafetyNetAppsVerificationFailed": "block",
    "requiredAndroidSafetyNetEvaluationType": "basic",
    "deviceLockRequired": false,
    "appActionIfDeviceLockNotSet": "block",
    "appActionIfDevicePasscodeComplexityLessThanLow": null,
    "appActionIfDevicePasscodeComplexityLessThanMedium": null,
    "appActionIfDevicePasscodeComplexityLessThanHigh": null,
    "keyboardsRestricted": false,
    "approvedKeyboards": [],
    "biometricAuthenticationBlocked": false,
    "connectToVpnOnLaunch": false,
    "fingerprintAndBiometricEnabled": true,
    "requirePinAfterBiometricChange": false,
    "requireClass3Biometrics": false,
    "maximumAllowedDeviceThreatLevel": "notConfigured",
    "mobileThreatDefenseRemediationAction": "block",
    "mobileThreatDefensePartnerPriority": null,
    "apps": [],
    "assignments": [
        {
            "target": {
                "groupId": "d5eab6d2-d828-4565-842e-89e0690b2a2a",
                "deviceAndAppManagementAssignmentFilterId": null,
                "deviceAndAppManagementAssignmentFilterType": "none",
                "@odata.type": "#microsoft.graph.groupAssignmentTarget"
            }
        }
    ]
}