{
    "@odata.type": "#microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration",
    "displayName": "Android Device Restrictions",
    "roleScopeTagIds": [
        "0"
    ],
    "passwordMinimumLength": 8,
    "passwordMinimumLetterCharacters": 2,
    "passwordMinimumLowerCaseCharacters": 2,
    "passwordMinimumUpperCaseCharacters": 1,
    "passwordMinimumNonLetterCharacters": 1,
    "passwordMinimumNumericCharacters": 1,
    "passwordMinimumSymbolCharacters": 1,
    "workProfilePasswordMinimumLength": 8,
    "workProfilePasswordMinimumLetterCharacters": 2,
    "workProfilePasswordMinimumLowerCaseCharacters": 2,
    "workProfilePasswordMinimumUpperCaseCharacters": 1,
    "workProfilePasswordMinimumNonLetterCharacters": 1,
    "workProfilePasswordMinimumNumericCharacters": 1,
    "workProfilePasswordMinimumSymbolCharacters": 1,
    "appsDefaultPermissionPolicy": "prompt",
    "kioskCustomizationSystemNavigation": "notConfigured",
    "kioskCustomizationStatusBar": "notConfigured",
    "crossProfilePoliciesAllowDataSharing": "notConfigured",
    "enrollmentProfile": "notConfigured",
    "passwordRequiredType": "lowSecurityBiometric",
    "passwordRequireUnlock": "deviceDefault",
    "workProfilePasswordRequiredType": "lowSecurityBiometric",
    "workProfilePasswordRequireUnlock": "deviceDefault",
    "personalProfilePlayStoreMode": "notConfigured",
    "screenCaptureBlocked": true,
    "storageBlockUsbFileTransfer": true,
    "locateDeviceLostModeEnabled": true,
    "passwordExpirationDays": 90,
    "passwordPreviousPasswordCountToBlock": 5,
    "passwordSignInFailureCountBeforeFactoryReset": 5,
    "usersBlockAdd": true,
    "workProfilePasswordExpirationDays": 90,
    "workProfilePasswordPreviousPasswordCountToBlock": 5,
    "workProfilePasswordSignInFailureCountBeforeFactoryReset": 5,
    "systemUpdateFreezePeriods": [],
    "passwordBlockKeyguardFeatures": [],
    "vpnAlwaysOnPackageIdentifier": "",
    "vpnAlwaysOnLockdownMode": false,
    "securityRequireVerifyApps": true
}